src/InformationRegisters/МП_ИзмененныеТрудозатраты/МП_ИзмененныеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ИзмененныеТрудозатраты</name>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Граница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СведенияОМобильныхКлиентах/СведенияОМобильныхКлиентах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОМобильныхКлиентах</name>
  <resources>
    <name>ВерсияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГраницаСборкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПервоначальнойЗагрузкиДанных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтметкаВремениСборкиДанных</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <dimensions>
    <name>МобильныйКлиент</name>
    <type>
      <types>CatalogRef.ПользователиМобильногоПриложения</types>
      <types>ExchangePlanRef.Мобильный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/МП_ИзмененныеТрудозатраты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ИзменитьЗапись(Пользователь, Период, НомерДобавления, Удалена = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.НомерДобавления.Установить(НомерДобавления);
	НЗ.Отбор.День.Установить(НачалоДня(Период));
	
	МЗ = НЗ.Добавить();
	МЗ.День = НачалоДня(Период);
	МЗ.Пользователь = Пользователь;
	МЗ.НомерДобавления = НомерДобавления;
	МЗ.Граница = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МЗ.Удалена = Удалена;
	НЗ.Записать();
	
КонецПроцедуры

Функция  ЕстьИзмененияПозжеГраницыОтправленныхДанных(МобильноеПриложение, Пользователь, Период, НомерДобавления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СведенияОМобильныхКлиентах.ГраницаСборкиДанных КАК Граница
		|ПОМЕСТИТЬ ГраницаСборкиДанных
		|ИЗ
		|	РегистрСведений.СведенияОМобильныхКлиентах КАК СведенияОМобильныхКлиентах
		|ГДЕ
		|	СведенияОМобильныхКлиентах.МобильныйКлиент = &МобильноеПриложение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МП_ИзмененныеТрудозатраты.Граница КАК Граница
		|ИЗ
		|	РегистрСведений.МП_ИзмененныеТрудозатраты КАК МП_ИзмененныеТрудозатраты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницаСборкиДанных КАК ПоследняяОтметкаСборкиДанных
		|		ПО МП_ИзмененныеТрудозатраты.Граница > ПоследняяОтметкаСборкиДанных.Граница
		|ГДЕ
		|	МП_ИзмененныеТрудозатраты.День = КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И МП_ИзмененныеТрудозатраты.Пользователь = &Пользователь
		|	И МП_ИзмененныеТрудозатраты.НомерДобавления = &НомерДобавления";
	
	Запрос.УстановитьПараметр("МобильноеПриложение", МобильноеПриложение);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НомерДобавления", НомерДобавления);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура УдалитьЗаписьОТрудозатрате(Пользователь, День, НомерДобавления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МП_ИзмененныеТрудозатраты.День КАК День
		|ИЗ
		|	РегистрСведений.МП_ИзмененныеТрудозатраты КАК МП_ИзмененныеТрудозатраты
		|ГДЕ
		|	МП_ИзмененныеТрудозатраты.Пользователь = &Пользователь
		|	И МП_ИзмененныеТрудозатраты.НомерДобавления = &НомерДобавления
		|	И МП_ИзмененныеТрудозатраты.День = НачалоПериода(&День, День)";
	
	Запрос.УстановитьПараметр("День", День);
	Запрос.УстановитьПараметр("НомерДобавления", НомерДобавления);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьЗапись(Пользователь, День, НомерДобавления, Истина);
	
КонецПроцедуры

#КонецЕсли
